// • Пилешко меню – 10.35 лв.

// • Меню с риба – 12.40 лв.

// • Вегетарианско меню – 8.15 лв.

// Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.

// Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).

// Цената на доставка е 2.50 лв и се начислява най-накрая. 
// Брой пилешки менюта – цяло число в интервала [0 … 99]

// · Брой менюта с риба – цяло число в интервала [0 … 99]

// · Брой вегетариански менюта – цяло число в интервала [0 … 99] 

function foodDelivery(input){

    let chikenPriceNew = 10.35;
    let fishPriceNew = 12.40;
    let veganPriceNew = 8.15;
    let deliveryTax = 2.5;

    let orderSum = (Number(input[0]) * chikenPriceNew +  Number(input[1]) * fishPriceNew +  Number(input[2]) * veganPriceNew)*1.2 + deliveryTax;
    console.log(orderSum);
    


}
foodDelivery(["9 ",

    "2 ",
    
    "6 "]);